Revit 2027 API
View.HideElementsTemporary Method
 Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideElementsTemporary(
	ICollection<ElementId> elementIdSet
)
Public Sub HideElementsTemporary (
	elementIdSet As ICollection(Of ElementId)
)
public:
void HideElementsTemporary(
	ICollection<ElementId^>^ elementIdSet
)
member HideElementsTemporary :
        elementIdSet : ICollection<ElementId> -> unit
Parameters
elementIdSet ICollection<ElementId>
 Ids of the elements to be temporarily hidden.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace